## Plan for orchestrator
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.scan_runner_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_runner_policies"  {
      ~ id      = "215035007" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs:log-group:/aws/ecs/runners_owasp_zap_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs:log-group:/aws/ecs/runners_nuclei_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/runners/owasp-zap",
                          - "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/runners/nuclei",
                          - "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/orchestrator",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:DescribeTaskDefinition",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:4",
                          - "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-nuclei:1",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:StartExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateStateMachine",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:507252742351:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:507252742351:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::507252742351:role/security_tools_execution_role",
                          - "arn:aws:iam::507252742351:role/scan-websites-orchestrator",
                          - "arn:aws:iam::507252742351:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-nuclei:1",
              ~ (known after apply),
                # (1 unchanged element hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_ecs_task_definition.runners-nuclei must be replaced
-/+ resource "aws_ecs_task_definition" "runners-nuclei" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-nuclei:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ environment      = [
                      ~ {
                          ~ value = "scan-websites-production-owasp-zap-report-data" -> "scan-websites-production-nuclei-report-data"
                            # (1 unchanged element hidden)
                        },
                    ]
                    # (9 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "runners-nuclei" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "scan-websites-production"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.orchestrator will be updated in-place
  ~ resource "aws_iam_policy" "orchestrator" {
        id        = "arn:aws:iam::507252742351:policy/scan-websites-orchestrator"
        name      = "scan-websites-orchestrator"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs:log-group:/aws/ecs/runners_owasp_zap_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs:log-group:/aws/ecs/runners_nuclei_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_nuclei_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/runners/owasp-zap",
                          - "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/runners/nuclei",
                          - "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/orchestrator",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:DescribeTaskDefinition",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:4",
                          - "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-nuclei:1",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:StartExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateStateMachine",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:507252742351:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:507252742351:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::507252742351:role/security_tools_execution_role",
                          - "arn:aws:iam::507252742351:role/scan-websites-orchestrator",
                          - "arn:aws:iam::507252742351:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.orchestrator will be updated in-place
  ~ resource "aws_lambda_function" "orchestrator" {
        id                             = "orchestrator"
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CLUSTER"                      = "arn:aws:ecs:ca-central-1:507252742351:cluster/scanning-tools"
              - "MAX_ECS_CAPACITY"             = "5"
              - "MIN_ECS_CAPACITY"             = "1"
              - "NUCLEI_REPORT_DATA_BUCKET"    = "scan-websites-production-nuclei-report-data"
              - "NUCLEI_TASK_DEF_ARN"          = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-nuclei:1"
              - "OWASP_ZAP_REPORT_DATA_BUCKET" = "scan-websites-production-owasp-zap-report-data"
              - "OWASP_ZAP_SCAN_THREADS"       = "3"
              - "OWASP_ZAP_TASK_DEF_ARN"       = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:4"
              - "PRIVATE_SUBNETS"              = "subnet-0c3abcc29d00b8589,subnet-0d16dd34a0f0a4589,subnet-0e48adc704a15a982"
              - "SECURITY_GROUP"               = "sg-0ffc24ab70e3c764d"
              - "STEP_FUNC_ROLE_ARN"           = "arn:aws:iam::507252742351:role/scan-websites-orchestrator"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nuclei-log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.owasp-zap-log"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.runners-nuclei"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.runners-owasp-zap"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.runners-nuclei"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.runners-owasp-zap"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.zap_runner_policies"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.container_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.task_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.security_tools_scanning"]

22 tests, 8 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
